Revit 2027 API
DirectShape.IsValidReferencePlaneBoundingBoxUV Method
 Validates that the input BoundingBoxUV is suitable for bounding a reference plane surface. The input BoundingBoxUV must be set and not degenerate.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidReferencePlaneBoundingBoxUV(
	BoundingBoxUV boundingBoxUV
)
Public Shared Function IsValidReferencePlaneBoundingBoxUV (
	boundingBoxUV As BoundingBoxUV
) As Boolean
public:
static bool IsValidReferencePlaneBoundingBoxUV(
	BoundingBoxUV^ boundingBoxUV
)
static member IsValidReferencePlaneBoundingBoxUV :
        boundingBoxUV : BoundingBoxUV -> bool
Parameters
boundingBoxUV BoundingBoxUV
 The reference plane BoundingBoxUV to test.
Return Value
Boolean
 True if the input BoundingBoxUV is valid for reference plane surfaces, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace